Revit 2027 API
StructuralSectionErrorCode Enumeration
 Error codes for StructuralSection related operations.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StructuralSectionErrorCode
Public Enumeration StructuralSectionErrorCode
public enum class StructuralSectionErrorCode
type StructuralSectionErrorCode
Members
Member name | Value | Description
ElementHasIndependentJustification | 7
ElementNotSupported | 4
Failure | 1
IncompleteDefinition | 3
MediumAndFineDetailShapesAreInconsistent | 6
MediumDetailShapeHasRounding | 5
ShapeNotRecognized | 2
Success | 0
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace